{
  "Anatomy and Physiology II": {
    "Endocrine System": {
      "What is the endocrine system?": "A collection of ductless glands that secrete hormones into the bloodstream to regulate metabolism, growth, reproduction, and other body functions.",
      "What is the role of the hypothalamus?": "Acts as the master regulator by producing releasing and inhibiting hormones that control the anterior pituitary gland.",
      "What hormones are produced by the anterior pituitary gland?": "TSH (Thyroid-Stimulating Hormone), ACTH (Adrenocorticotropic Hormone), GH (Growth Hormone), LH (Luteinizing Hormone), FSH (Follicle-Stimulating Hormone), Prolactin.",
      "What is the function of TSH (Thyroid-Stimulating Hormone)?": "Stimulates the thyroid gland to produce thyroid hormones (T3 and T4), which regulate metabolism.",
      "What is the function of ACTH (Adrenocorticotropic Hormone)?": "Stimulates the adrenal cortex to release cortisol and other glucocorticoids.",
      "What is the function of GH (Growth Hormone)?": "Promotes growth, cell reproduction, and regeneration in tissues, especially bones and muscles.",
      "What is the function of LH (Luteinizing Hormone) and FSH (Follicle-Stimulating Hormone)?": "LH triggers ovulation and stimulates the production of sex hormones in the ovaries and testes; FSH stimulates the growth of ovarian follicles and sperm production.",
      "What is the role of prolactin?": "Stimulates milk production in the mammary glands.",
      "What hormones are stored and released by the posterior pituitary gland?": "ADH (Antidiuretic Hormone) and Oxytocin, both produced by the hypothalamus.",
      "What is the function of ADH (Antidiuretic Hormone)?": "Promotes water retention by the kidneys, reducing urine volume and helping to maintain blood pressure.",
      "What is the function of oxytocin?": "Triggers uterine contractions during childbirth and milk ejection during breastfeeding.",
      "What hormones are produced by the thyroid gland?": "T3 (Triiodothyronine), T4 (Thyroxine), and Calcitonin.",
      "What is the function of T3 and T4?": "Regulate metabolism, heart rate, and body temperature; T3 is the more active form.",
      "What is the function of calcitonin?": "Lowers blood calcium levels by inhibiting osteoclast activity and promoting calcium deposition in bones.",
      "What hormones are produced by the parathyroid glands?": "PTH (Parathyroid Hormone).",
      "What is the function of PTH (Parathyroid Hormone)?": "Raises blood calcium levels by stimulating osteoclasts, increasing calcium reabsorption in the kidneys, and enhancing calcium absorption in the intestines.",
      "What hormones are produced by the adrenal cortex?": "Glucocorticoids (e.g., cortisol), Mineralocorticoids (e.g., aldosterone), and Androgens.",
      "What is the function of cortisol?": "Regulates metabolism, reduces inflammation, and helps the body respond to stress.",
      "What is the function of aldosterone?": "Regulates sodium and potassium balance by promoting sodium retention and potassium excretion in the kidneys.",
      "What hormones are produced by the adrenal medulla?": "Catecholamines (Epinephrine and Norepinephrine).",
      "What is the function of epinephrine and norepinephrine?": "Prepare the body for fight-or-flight responses by increasing heart rate, blood pressure, and blood glucose levels.",
      "What hormones are produced by the pancreas?": "Insulin and Glucagon.",
      "What is the function of insulin?": "Lowers blood glucose levels by promoting glucose uptake into cells and glycogen storage.",
      "What is the function of glucagon?": "Raises blood glucose levels by promoting glycogen breakdown and glucose release by the liver.",
      "What hormone is produced by the pineal gland?": "Melatonin.",
      "What is the function of melatonin?": "Regulates sleep-wake cycles and circadian rhythms, with production increasing in response to darkness.",
      "What hormones are produced by the ovaries?": "Estrogen and Progesterone.",
      "What is the function of estrogen?": "Regulates the menstrual cycle, promotes the development of secondary sexual characteristics, and prepares the uterus for pregnancy.",
      "What is the function of progesterone?": "Prepares the uterus for implantation of a fertilized egg and maintains pregnancy.",
      "What hormone is produced by the testes?": "Testosterone.",
      "What is the function of testosterone?": "Regulates sperm production and the development of male secondary sexual characteristics."
    },
    "Cardiovascular System": {
      "What are the main functions of the cardiovascular system?": "To transport oxygen, nutrients, hormones, and waste products throughout the body, and to help regulate body temperature and pH balance.",
      "What are the four chambers of the heart?": "Right atrium, right ventricle, left atrium, left ventricle.",
      "What is the function of the right atrium?": "Receives deoxygenated blood from the body via the superior and inferior vena cava.",
      "What is the function of the right ventricle?": "Pumps deoxygenated blood to the lungs through the pulmonary arteries.",
      "What is the function of the left atrium?": "Receives oxygenated blood from the lungs via the pulmonary veins.",
      "What is the function of the left ventricle?": "Pumps oxygenated blood to the body through the aorta.",
      "What are the atrioventricular (AV) valves?": "The Tricuspid Valve (right side) and the Mitral/Bicuspid Valve (left side) between the atria and ventricles.",
      "What are the semilunar valves?": "The Pulmonary Valve (between right ventricle and pulmonary artery) and the Aortic Valve (between left ventricle and aorta).",
      "What is the function of the sinoatrial (SA) node?": "Acts as the pacemaker of the heart, initiating electrical impulses that cause the heart to beat.",
      "What is the pathway of blood through the heart?": "Right atrium → right ventricle → pulmonary artery → lungs → pulmonary veins → left atrium → left ventricle → aorta.",
      "What is the cardiac cycle?": "The sequence of events that occur when the heart beats, including diastole (relaxation) and systole (contraction).",
      "What is the role of the ECG (electrocardiogram)?": "Measures the electrical activity of the heart, showing the P wave, QRS complex, and T wave.",
      "What is the function of the arteries?": "Carry oxygenated blood away from the heart to the tissues of the body (except the pulmonary arteries).",
      "What is the function of the veins?": "Carry deoxygenated blood back to the heart (except the pulmonary veins).",
      "What is the function of capillaries?": "Serve as the site of gas, nutrient, and waste exchange between the blood and tissues.",
      "What is blood pressure?": "The force exerted by circulating blood on the walls of blood vessels, typically measured in systolic/diastolic values.",
      "What regulates blood pressure?": "The autonomic nervous system (baroreceptors), hormones (RAAS, ADH, ANP), and the kidneys.",
      "What is the Renin-Angiotensin-Aldosterone System (RAAS)?": "A hormone system that regulates blood pressure and fluid balance, involving renin, angiotensin, and aldosterone.",
      "What is hypertension?": "Chronically high blood pressure, which increases the risk of heart disease, stroke, and other complications.",
      "What is atherosclerosis?": "The buildup of plaque in the arteries, leading to reduced blood flow and an increased risk of heart attack.",
      "What is a myocardial infarction?": "Commonly known as a heart attack, it occurs when blood flow to a part of the heart is blocked, causing tissue damage.",
      "What are arrhythmias?": "Abnormal heart rhythms that can disrupt normal cardiac function, ranging from benign to life-threatening."
    },
    "Lymphatic and Immune System": {
      "What are the main functions of the lymphatic system?": "To return excess interstitial fluid to the bloodstream, absorb dietary fats, and provide immune responses.",
      "What is lymph?": "A clear fluid similar to plasma that contains immune cells, proteins, and waste products.",
      "What are the primary lymphoid organs?": "Thymus and bone marrow, where lymphocytes (T cells and B cells) mature.",
      "What is the role of lymph nodes?": "Filter lymph, trapping pathogens and foreign particles, and house lymphocytes that initiate immune responses.",
      "What is the spleen?": "The largest lymphoid organ, which filters blood, recycles old red blood cells, and helps fight infection.",
      "What is the function of the thymus?": "Site of T cell maturation, crucial for the adaptive immune response.",
      "What are B cells?": "Lymphocytes that produce antibodies, which neutralize or mark pathogens for destruction.",
      "What are T cells?": "Lymphocytes that directly attack infected cells or regulate other immune responses.",
      "What is the difference between innate and adaptive immunity?": "Innate immunity is the body's first line of defense against pathogens (non-specific), while adaptive immunity targets specific invaders and has memory.",
      "What is inflammation?": "A localized immune response to injury or infection, characterized by redness, heat, swelling, and pain.",
      "What is the function of antibodies?": "Proteins produced by B cells that bind to specific antigens on pathogens, marking them for destruction.",
      "What is the complement system?": "A group of proteins that enhance the immune response by promoting inflammation, opsonization, and lysis of pathogens.",
      "What is an autoimmune disease?": "A condition where the immune system mistakenly attacks the body's own tissues (e.g., rheumatoid arthritis, lupus).",
      "What is the difference between active and passive immunity?": "Active immunity involves the body's own production of antibodies (e.g., after infection or vaccination), while passive immunity is provided by antibodies from another source (e.g., mother to baby, antibody injections).",
      "What is lymphedema?": "Swelling due to blockage or damage to lymphatic vessels, preventing normal lymph drainage."
    },
    "Respiratory System": {
      "What are the primary functions of the respiratory system?": "To exchange gases (oxygen and carbon dioxide) between the air and the blood, and to help regulate blood pH.",
      "What is the pathway of air through the respiratory system?": "Nose/mouth → pharynx → larynx → trachea → bronchi → bronchioles → alveoli.",
      "What is the function of the nasal cavity?": "Filters, warms, and moistens air as it enters the respiratory system.",
      "What is the role of the larynx?": "Contains the vocal cords and routes air and food into the proper channels.",
      "What is the function of the trachea?": "The windpipe that conducts air from the larynx to the bronchi, reinforced by C-shaped cartilage rings.",
      "What are the bronchi and bronchioles?": "The bronchi are large airways that branch from the trachea into each lung, and bronchioles are smaller branches that lead to the alveoli.",
      "What are the alveoli?": "Tiny air sacs in the lungs where gas exchange occurs between the air and the blood.",
      "What is the process of gas exchange in the alveoli?": "Oxygen diffuses from the alveoli into the pulmonary capillaries, while carbon dioxide diffuses from the blood into the alveoli to be exhaled.",
      "What muscles are involved in inspiration?": "The diaphragm and external intercostal muscles contract, expanding the thoracic cavity and drawing air into the lungs.",
      "What is the role of the diaphragm in breathing?": "A dome-shaped muscle that contracts to increase the volume of the thoracic cavity during inspiration.",
      "How is oxygen transported in the blood?": "Primarily bound to hemoglobin in red blood cells as oxyhemoglobin.",
      "How is carbon dioxide transported in the blood?": "Dissolved in plasma, bound to hemoglobin as carbaminohemoglobin, or converted to bicarbonate ions in the plasma.",
      "What is the role of the medulla oblongata in respiration?": "It controls the basic rhythm of breathing by sending signals to the respiratory muscles.",
      "What are chemoreceptors and how do they regulate breathing?": "Sensory receptors that detect changes in blood pH, CO2, and O2 levels, and adjust ventilation to maintain homeostasis.",
      "What is asthma?": "A chronic inflammatory disease of the airways characterized by episodes of wheezing, breathlessness, and coughing.",
      "What is Chronic Obstructive Pulmonary Disease (COPD)?": "A group of lung diseases, including emphysema and chronic bronchitis, that cause airflow obstruction and breathing difficulties.",
      "What is pneumonia?": "An infection of the lungs that inflames the air sacs, leading to fluid accumulation and impaired gas exchange.",
      "What is a pulmonary embolism?": "A blockage in one of the pulmonary arteries in the lungs, usually caused by a blood clot, leading to decreased oxygenation of blood."
    },
    "Digestive System": {
      "What is the main function of the digestive system?": "To break down food into nutrients that can be absorbed into the bloodstream and eliminate waste.",
      "What are the primary processes of digestion?": "Ingestion, mechanical digestion, chemical digestion, absorption, and defecation.",
      "What is the role of the mouth in digestion?": "Begins mechanical digestion through chewing (mastication) and chemical digestion with saliva containing amylase.",
      "What is the function of the salivary glands?": "Produce saliva, which contains enzymes (amylase) that begin the breakdown of carbohydrates.",
      "What is the esophagus?": "A muscular tube that transports food from the pharynx to the stomach via peristalsis.",
      "What is peristalsis?": "Involuntary, wave-like muscle contractions that move food through the digestive tract.",
      "What is the role of the stomach in digestion?": "Secretes gastric juices, including HCl and pepsin, to chemically break down proteins and churns food to mix it with digestive enzymes.",
      "What is chyme?": "The semi-liquid mixture of partially digested food and gastric juices that forms in the stomach and moves into the small intestine.",
      "What is the small intestine and its function?": "The primary site of nutrient absorption; consists of three sections: duodenum, jejunum, and ileum.",
      "What is the role of the duodenum?": "The first part of the small intestine where most chemical digestion occurs, receiving bile from the liver and pancreatic enzymes.",
      "What is the function of the villi and microvilli in the small intestine?": "Increase the surface area for absorption of nutrients into the bloodstream.",
      "What is the role of the liver in digestion?": "Produces bile, which emulsifies fats to aid in their digestion.",
      "What is the function of the gallbladder?": "Stores and concentrates bile, releasing it into the duodenum when needed for fat digestion.",
      "What are the exocrine functions of the pancreas?": "Produces digestive enzymes (amylase, lipase, proteases) and bicarbonate to neutralize stomach acid in the duodenum.",
      "What is the role of the large intestine?": "Absorbs water and electrolytes, forming solid feces, and houses gut bacteria that produce vitamins like vitamin K.",
      "What is the function of the rectum and anus?": "Store and expel feces during defecation.",
      "What enzymes are involved in protein digestion?": "Pepsin (stomach), trypsin, and chymotrypsin (pancreas).",
      "What is the role of bile in fat digestion?": "Bile emulsifies fats, breaking them into smaller droplets that are more easily digested by enzymes like lipase.",
      "What is the role of the enteric nervous system?": "The 'gut brain,' a local neural network that regulates gastrointestinal motility and secretion independently of the central nervous system.",
      "What hormones regulate digestive processes?": "Gastrin (stimulates gastric juice secretion), secretin (stimulates bicarbonate release), and cholecystokinin (CCK, stimulates bile and pancreatic enzyme release).",
      "What is GERD (Gastroesophageal Reflux Disease)?": "A condition where stomach acid flows back into the esophagus, causing heartburn and potential damage to the esophageal lining.",
      "What is a peptic ulcer?": "An erosion of the stomach or duodenal lining caused by excess acid or infection with Helicobacter pylori.",
      "What is Irritable Bowel Syndrome (IBS)?": "A functional disorder characterized by abdominal pain, bloating, and altered bowel habits (diarrhea or constipation).",
      "What is Inflammatory Bowel Disease (IBD)?": "Chronic inflammation of the digestive tract, including conditions like Crohn's disease and ulcerative colitis."
    },
    "Urinary System": {
      "What are the primary functions of the urinary system?": "To remove waste products from the blood, regulate blood volume and pressure, balance electrolytes and pH, and detoxify the body.",
      "What are the main organs of the urinary system?": "Kidneys, ureters, bladder, and urethra.",
      "What is the structure and function of the kidneys?": "Bean-shaped organs that filter blood, remove waste, and regulate electrolyte balance; contain nephrons, the functional units.",
      "What is the nephron and its role?": "The functional unit of the kidney that filters blood, reabsorbs needed substances, and secretes waste into the urine.",
      "What is the glomerulus?": "A network of capillaries in the nephron where blood filtration occurs.",
      "What is the role of the proximal convoluted tubule (PCT)?": "Reabsorbs nutrients, ions, and water from the filtrate back into the bloodstream.",
      "What is the loop of Henle and its function?": "Creates a concentration gradient in the medulla to concentrate urine by reabsorbing water and salts.",
      "What is the role of the distal convoluted tubule (DCT)?": "Further reabsorbs ions and water, regulated by hormones like aldosterone.",
      "What is the function of the collecting duct?": "Final adjustments to urine composition; reabsorbs water under the influence of ADH.",
      "What is glomerular filtration?": "The process by which blood pressure forces water, ions, and small molecules from the blood into Bowman's capsule, forming the filtrate.",
      "What is tubular reabsorption?": "The process by which the nephron reclaims valuable substances from the filtrate back into the bloodstream.",
      "What is tubular secretion?": "The active transport of waste products and excess ions from the blood into the filtrate, primarily in the DCT and collecting duct.",
      "What is the role of ADH in the kidneys?": "Increases water reabsorption in the collecting ducts, reducing urine volume and increasing blood volume.",
      "What triggers the release of renin?": "Low blood pressure or low sodium levels in the blood stimulate renin release from the kidneys.",
      "What is the function of aldosterone?": "Promotes sodium reabsorption and potassium excretion, leading to water retention and increased blood pressure.",
      "What is the role of the ureters?": "Transport urine from the kidneys to the bladder via peristalsis.",
      "What is the function of the bladder?": "Stores urine until it is excreted.",
      "What is the function of the urethra?": "Carries urine from the bladder to the outside of the body during urination.",
      "What is micturition?": "The process of urination, involving the coordinated relaxation of the urethral sphincters and contraction of the bladder muscles.",
      "What is acid-base balance and how is it regulated?": "The maintenance of the body's pH within a narrow range; regulated by buffer systems, respiratory compensation, and renal compensation.",
      "What is chronic kidney disease (CKD)?": "Progressive loss of kidney function over time, potentially leading to end-stage renal disease (ESRD) requiring dialysis or transplantation.",
      "What is acute kidney injury (AKI)?": "Sudden loss of kidney function, often reversible with prompt treatment.",
      "What are kidney stones (renal calculi)?": "Crystallized minerals in the kidney that can obstruct urine flow, causing pain and potential damage to the kidney.",
      "What is urinalysis?": "A test that examines the content of urine to detect and diagnose various conditions, including infections, kidney disease, and diabetes."
    },
    "Reproductive System": {
      "What are the primary functions of the reproductive system?": "To produce, store, and transport gametes (sperm and eggs) and facilitate fertilization and the development of offspring.",
      "What is the structure and function of the testes?": "Male reproductive organs that produce sperm (spermatogenesis) and secrete testosterone.",
      "What is spermatogenesis?": "The production of sperm through meiosis in the seminiferous tubules of the testes.",
      "What are the components of sperm?": "Head (contains DNA), midpiece (packed with mitochondria for energy), and tail (flagellum for movement).",
      "What is the role of the epididymis?": "Coiled tube where sperm mature and are stored until ejaculation.",
      "What is the function of the vas deferens?": "Transports sperm from the epididymis to the urethra during ejaculation.",
      "What is the role of the seminal vesicles?": "Produce seminal fluid that contains fructose, providing energy for sperm.",
      "What is the function of the prostate gland?": "Produces a slightly alkaline fluid that makes up part of the semen and neutralizes acidity in the female reproductive tract.",
      "What is the function of the bulbourethral glands?": "Secrete mucus that lubricates the urethra during ejaculation.",
      "What is the structure and function of the ovaries?": "Female reproductive organs that produce eggs (oogenesis) and secrete estrogen and progesterone.",
      "What is oogenesis?": "The production of eggs through meiosis, beginning before birth and resuming during puberty.",
      "What occurs during ovulation?": "The release of a mature egg (secondary oocyte) from the ovary, typically around day 14 of the menstrual cycle.",
      "What is the role of the fallopian tubes (oviducts)?": "Transport the egg from the ovary to the uterus and serve as the site of fertilization.",
      "What is the structure and function of the uterus?": "A muscular organ that provides a site for implantation of the fertilized egg and supports fetal development.",
      "What is the function of the endometrium?": "The inner lining of the uterus that thickens in preparation for pregnancy and is shed during menstruation if fertilization does not occur.",
      "What is the role of the cervix?": "The narrow lower portion of the uterus that opens into the vagina and dilates during childbirth.",
      "What is the menstrual cycle?": "The monthly cycle of changes in the female reproductive system, including the development and release of an egg and preparation of the uterus for pregnancy.",
      "What are the phases of the menstrual cycle?": "Follicular phase, ovulation, luteal phase, and menstruation.",
      "What is the function of estrogen in the menstrual cycle?": "Promotes the growth of the endometrium and regulates the menstrual cycle.",
      "What is the role of progesterone?": "Maintains the endometrium for potential pregnancy and inhibits uterine contractions.",
      "What is fertilization?": "The union of a sperm cell and an egg cell, typically occurring in the fallopian tube.",
      "What is the role of the placenta during pregnancy?": "An organ that provides oxygen and nutrients to the developing fetus and removes waste products.",
      "What are the trimesters of pregnancy?": "First trimester (organogenesis), second trimester (growth and development), third trimester (final maturation and preparation for birth).",
      "What is Polycystic Ovary Syndrome (PCOS)?": "A hormonal disorder causing enlarged ovaries with small cysts, leading to irregular menstrual cycles and infertility.",
      "What is endometriosis?": "A condition where endometrial tissue grows outside the uterus, causing pain and potential fertility issues.",
      "What is erectile dysfunction (ED)?": "The inability to achieve or maintain an erection sufficient for sexual intercourse.",
      "What is infertility?": "The inability to conceive after one year of unprotected intercourse, which can be due to various factors affecting either the male or female reproductive systems."
    }
  }
}
