{
  "Anatomy and Physiology II": {
    "Introduction to Psychology": {
      "What is psychology?": "The scientific study of behavior and mental processes.",
      "Who is Wilhelm Wundt, and why is he significant?": "Wilhelm Wundt is considered the father of psychology; he established the first psychology lab in 1879 and pioneered the method of introspection.",
      "What is Structuralism?": "An early school of thought in psychology that focused on breaking down mental processes into their most basic components, founded by Edward Titchener.",
      "What is Functionalism?": "A school of thought that emphasized the purpose of consciousness and behavior, focusing on how mental processes help organisms adapt to their environment. Influenced by William James.",
      "What is the difference between a psychologist and a psychiatrist?": "A psychologist typically has a Ph.D. or Psy.D. and focuses on therapy and research, while a psychiatrist is a medical doctor (M.D.) who can prescribe medication and treat mental disorders.",
      "What are the major research methods used in psychology?": "Experiments, correlational studies, case studies, surveys, and observational studies.",
      "What are the ethical guidelines in psychological research?": "Informed consent, confidentiality, debriefing, and protection from harm.",
      "What are the main goals of psychology?": "To describe, explain, predict, and control behavior and mental processes."
    },
    "Biological Basis of Behavior": {
      "What is a neuron?": "A nerve cell that is the basic building block of the nervous system, responsible for transmitting information throughout the body.",
      "What are the main parts of a neuron?": "Dendrites (receive signals), cell body (soma), axon (transmits signals), and synapse (gap between neurons where communication occurs).",
      "What is the function of neurotransmitters?": "Chemicals that transmit signals across the synapse from one neuron to another.",
      "What are the major neurotransmitters and their functions?": "Dopamine: Reward, pleasure, movement\nSerotonin: Mood, sleep, appetite\nAcetylcholine: Muscle action, memory\nGABA: Inhibitory, calming\nNorepinephrine: Arousal, alertness\nGlutamate: Excitatory, involved in learning and memory",
      "What is the central nervous system (CNS)?": "The brain and spinal cord, responsible for processing and transmitting information throughout the body.",
      "What is the peripheral nervous system (PNS)?": "The part of the nervous system outside the CNS, consisting of the somatic nervous system (voluntary control) and autonomic nervous system (involuntary control).",
      "What are the divisions of the autonomic nervous system?": "Sympathetic nervous system: Prepares the body for fight-or-flight responses.\nParasympathetic nervous system: Promotes rest-and-digest functions, calming the body.",
      "What are the major parts of the brain and their functions?": "Cerebral cortex: Higher-level functions like thinking, planning, and problem-solving.\nLimbic system: Emotion and memory, includes the amygdala and hippocampus.\nBrainstem: Basic life functions such as breathing and heartbeat.\nCerebellum: Coordination and balance.",
      "What is the role of the hypothalamus?": "Regulates basic bodily functions like hunger, thirst, temperature, and the release of hormones from the pituitary gland.",
      "What is the function of the thalamus?": "Acts as the brain's relay station, directing sensory information to the appropriate areas of the cerebral cortex.",
      "What is the endocrine system?": "A system of glands that secrete hormones into the bloodstream to regulate bodily functions.",
      "What are the major endocrine glands and their hormones?": "Pituitary gland: Growth hormone, ACTH, TSH\nAdrenal glands: Cortisol, adrenaline\nThyroid gland: Thyroxine\nPancreas: Insulin, glucagon\nPineal gland: Melatonin",
      "What is neuroplasticity?": "The brain's ability to reorganize and adapt by forming new neural connections throughout life.",
      "What is the role of the corpus callosum?": "A thick band of nerve fibers that connects the left and right hemispheres of the brain, allowing communication between them."
    },
    "Sensation and Perception": {
      "What is sensation?": "The process by which sensory receptors receive stimuli from the environment and transmit them to the brain.",
      "What is perception?": "The process of organizing and interpreting sensory information, enabling us to recognize meaningful objects and events.",
      "What is the difference between bottom-up and top-down processing?": "Bottom-up processing: Perception based on the physical features of the stimulus.\nTop-down processing: Perception influenced by expectations, experience, and knowledge.",
      "What is the absolute threshold?": "The minimum intensity of a stimulus that can be detected 50% of the time.",
      "What is the difference threshold (just noticeable difference)?": "The minimum difference in intensity between two stimuli that can be detected 50% of the time.",
      "What is sensory adaptation?": "The process by which sensory receptors become less sensitive to constant or unchanging stimuli.",
      "What is the function of the retina?": "The light-sensitive layer of the eye that contains photoreceptors (rods and cones) and processes visual information.",
      "What are rods and cones, and what are their functions?": "Rods: Photoreceptors that detect black, white, and gray; necessary for peripheral and night vision.\nCones: Photoreceptors that detect color and are responsible for sharp, detailed vision.",
      "What is the role of the optic nerve?": "Transmits visual information from the retina to the brain.",
      "What is the trichromatic theory of color vision?": "The theory that the retina contains three types of color receptors (red, green, blue) that work together to produce the perception of color.",
      "What is the opponent-process theory of color vision?": "The theory that color perception is based on the activity of three opposing color pairs: red-green, blue-yellow, and black-white.",
      "What is depth perception?": "The ability to perceive the world in three dimensions and judge distances.",
      "What are binocular and monocular cues for depth perception?": "Binocular cues: Depth cues that depend on the use of both eyes, such as retinal disparity.\nMonocular cues: Depth cues available to each eye separately, such as linear perspective and texture gradient.",
      "What is the role of the cochlea in hearing?": "A spiral-shaped organ in the inner ear that contains hair cells, which convert sound vibrations into neural signals.",
      "What is the difference between conductive and sensorineural hearing loss?": "Conductive hearing loss: Caused by damage to the outer or middle ear, which prevents sound from being conducted to the inner ear.\nSensorineural hearing loss: Caused by damage to the hair cells in the cochlea or the auditory nerve.",
      "What is the gate control theory of pain?": "The theory that the spinal cord contains a neurological 'gate' that either blocks or allows pain signals to pass to the brain."
    },
    "Learning": {
      "What is classical conditioning?": "A learning process in which a neutral stimulus becomes associated with an unconditioned stimulus, eventually triggering a conditioned response.",
      "What are the key components of classical conditioning?": "Unconditioned stimulus (US): Naturally triggers a response.\nUnconditioned response (UR): A naturally occurring response to the US.\nConditioned stimulus (CS): A previously neutral stimulus that, after association with the US, triggers a conditioned response.\nConditioned response (CR): A learned response to the conditioned stimulus.",
      "What is operant conditioning?": "A learning process in which behavior is shaped and maintained by its consequences, such as reinforcement or punishment.",
      "What are the types of reinforcement in operant conditioning?": "Positive reinforcement: Adding a pleasant stimulus to increase a behavior.\nNegative reinforcement: Removing an unpleasant stimulus to increase a behavior.",
      "What are the types of punishment in operant conditioning?": "Positive punishment: Adding an unpleasant stimulus to decrease a behavior.\nNegative punishment: Removing a pleasant stimulus to decrease a behavior.",
      "What is the difference between reinforcement schedules?": "Fixed-ratio: Reinforcement after a set number of responses.\nVariable-ratio: Reinforcement after an unpredictable number of responses.\nFixed-interval: Reinforcement after a set amount of time.\nVariable-interval: Reinforcement after an unpredictable amount of time.",
      "What is observational learning?": "Learning by observing and imitating the behavior of others, also known as social learning or modeling.",
      "What is the role of mirror neurons in observational learning?": "Neurons that fire both when an individual performs an action and when they observe someone else performing the same action, facilitating imitation and learning.",
      "What is latent learning?": "Learning that occurs without reinforcement and is not immediately demonstrated, becoming apparent only when there is an incentive to display it.",
      "What is the concept of learned helplessness?": "A condition in which an individual learns to feel powerless and stops trying to change their situation after repeated failures or exposure to uncontrollable events."
    },
    "Memory": {
      "What are the three processes of memory?": "Encoding, storage, and retrieval.",
      "What is sensory memory?": "The brief storage of sensory information, lasting only a few seconds, which allows us to perceive our environment.",
      "What are the two main types of sensory memory?": "Iconic memory: Visual sensory memory.\nEchoic memory: Auditory sensory memory.",
      "What is short-term memory (STM)?": "A limited-capacity memory system that holds information for a brief period (about 20-30 seconds) unless it is actively rehearsed.",
      "What is the capacity of short-term memory?": "Approximately 7 ± 2 items (Miller's magic number).",
      "What is working memory?": "A type of short-term memory that involves the active manipulation and processing of information to perform complex tasks.",
      "What are the components of Baddeley's model of working memory?": "Central executive: Directs attention and coordinates activities.\nPhonological loop: Processes verbal and auditory information.\nVisuospatial sketchpad: Processes visual and spatial information.\nEpisodic buffer: Integrates information from the phonological loop and visuospatial sketchpad with long-term memory.",
      "What is long-term memory (LTM)?": "A relatively permanent and limitless storehouse of information, including knowledge, skills, and experiences.",
      "What are the types of long-term memory?": "Explicit (declarative) memory: Conscious memories of facts and events.\nImplicit (non-declarative) memory: Unconscious memories of skills and conditioned responses.",
      "What is the difference between semantic and episodic memory?": "Semantic memory: General knowledge and facts.\nEpisodic memory: Personal experiences and events.",
      "What is procedural memory?": "A type of implicit memory for performing tasks and skills, such as riding a bike or playing an instrument.",
      "What is the serial position effect?": "The tendency to recall the first and last items in a list better than the middle items, known as the primacy and recency effects.",
      "What is the spacing effect?": "The phenomenon that information is better retained when learning is spaced out over time rather than crammed in a single session.",
      "What is chunking?": "A memory strategy that involves grouping individual items into larger, meaningful units to improve retention.",
      "What is the encoding specificity principle?": "The idea that memory is most effective when the conditions during encoding are similar to the conditions during retrieval.",
      "What is the difference between recall and recognition?": "Recall: Retrieving information from memory without cues (e.g., essay questions).\nRecognition: Identifying previously learned information from a list of options (e.g., multiple-choice questions).",
      "What is the misinformation effect?": "The tendency for post-event information to interfere with the memory of the original event, leading to distorted or false memories.",
      "What is the concept of flashbulb memory?": "A vivid, detailed memory of an emotionally significant event, though not necessarily more accurate than other memories.",
      "What is amnesia, and what are its types?": "Anterograde amnesia: Inability to form new memories after the onset of amnesia.\nRetrograde amnesia: Loss of memories from before the onset of amnesia.",
      "What is the role of the hippocampus in memory?": "A brain structure crucial for the formation and consolidation of new explicit memories."
    },
    "Cognition": {
      "What is cognition?": "The mental activities involved in acquiring, processing, and storing knowledge, such as thinking, problem-solving, and decision-making.",
      "What are concepts, and how do they function in cognition?": "Mental categories that group similar objects, events, or ideas, allowing for efficient thinking and communication.",
      "What is the difference between a prototype and an exemplar?": "Prototype: The most typical or ideal example of a concept.\nExemplar: A specific example within a category based on personal experience.",
      "What is problem-solving, and what are its common strategies?": "The process of finding solutions to difficult or complex issues, using strategies such as algorithms, heuristics, trial and error, and insight.",
      "What is the difference between an algorithm and a heuristic?": "Algorithm: A step-by-step procedure that guarantees a solution.\nHeuristic: A mental shortcut that may lead to a solution more quickly but does not guarantee accuracy.",
      "What is confirmation bias?": "The tendency to search for, interpret, and remember information that confirms one's preexisting beliefs while ignoring or discounting evidence to the contrary.",
      "What is the availability heuristic?": "Estimating the likelihood of events based on their availability in memory; events that are more easily recalled are perceived as more common.",
      "What is the representativeness heuristic?": "Judging the probability of an event based on how similar it is to a prototype or stereotype, rather than considering base rates or actual probabilities.",
      "What is functional fixedness?": "The tendency to perceive objects only in terms of their typical functions, which can hinder problem-solving.",
      "What is the difference between convergent and divergent thinking?": "Convergent thinking: Narrowing down multiple possibilities to find the single best solution.\nDivergent thinking: Generating many different ideas or solutions to a problem, associated with creativity.",
      "What is language, and what are its key components?": "A system of symbols and rules used for communication, including phonemes, morphemes, syntax, and semantics.",
      "What is the Sapir-Whorf hypothesis (linguistic relativity)?": "The idea that the structure of a language influences how its speakers perceive and think about the world.",
      "What is the difference between fluid and crystallized intelligence?": "Fluid intelligence: The ability to reason quickly and think abstractly, typically peaking in early adulthood.\nCrystallized intelligence: The accumulation of knowledge and skills gained through experience, which tends to increase with age.",
      "What is emotional intelligence?": "The ability to perceive, understand, manage, and use emotions effectively in interactions with others.",
      "What is the difference between inductive and deductive reasoning?": "Inductive reasoning: Drawing general conclusions from specific observations.\nDeductive reasoning: Drawing specific conclusions based on general principles or premises.",
      "What is the role of the prefrontal cortex in decision-making?": "Involved in higher-order cognitive processes such as planning, impulse control, and evaluating the consequences of actions."
    },
    "Developmental Psychology": {
      "What is developmental psychology?": "The study of how people grow, develop, and change throughout the lifespan, from infancy to old age.",
      "What are the stages of prenatal development?": "Germinal stage (0-2 weeks): Fertilization and implantation.\nEmbryonic stage (2-8 weeks): Formation of major organs and structures.\nFetal stage (8 weeks-birth): Continued growth and development of the body and brain.",
      "What are teratogens, and how do they affect development?": "Environmental agents that can cause harm during prenatal development, such as drugs, alcohol, or certain infections.",
      "What is the rooting reflex?": "An automatic response in newborns where they turn their head and open their mouth when touched on the cheek, aiding in feeding.",
      "What are Piaget's stages of cognitive development?": "Sensorimotor stage (0-2 years): Learning through sensory experiences and motor actions; object permanence develops.\nPreoperational stage (2-7 years): Symbolic thinking, egocentrism, and lack of conservation.\nConcrete operational stage (7-11 years): Logical thinking about concrete events; understanding of conservation and reversibility.\nFormal operational stage (12+ years): Abstract, logical, and systematic thinking.",
      "What is object permanence?": "The understanding that objects continue to exist even when they are not visible, developed during the sensorimotor stage.",
      "What is egocentrism in Piaget's theory?": "The inability to see the world from others' perspectives, characteristic of the preoperational stage.",
      "What is conservation in Piaget's theory?": "The understanding that certain properties of objects, such as volume, mass, or number, remain the same despite changes in their form or appearance.",
      "What is Vygotsky's concept of the zone of proximal development (ZPD)?": "The range of tasks that a child can perform with the help and guidance of others but cannot yet perform independently.",
      "What is the role of scaffolding in Vygotsky's theory?": "The support and guidance provided by adults or more knowledgeable peers that help a child learn within their zone of proximal development.",
      "What is attachment, and what are its types according to Ainsworth's 'Strange Situation'?": "Secure attachment: Child feels confident exploring but seeks comfort from the caregiver when distressed.\nInsecure-avoidant attachment: Child avoids or ignores the caregiver, showing little emotion when they leave or return.\nInsecure-resistant attachment: Child is clingy and dependent but rejects the caregiver's comfort when upset.\nDisorganized attachment: Child shows inconsistent, confused, or contradictory behavior toward the caregiver.",
      "What is Erikson's theory of psychosocial development?": "A lifespan theory that outlines eight stages of development, each characterized by a specific conflict that must be resolved:\nTrust vs. Mistrust (Infancy)\nAutonomy vs. Shame and Doubt (Toddlerhood)\nInitiative vs. Guilt (Preschool)\nIndustry vs. Inferiority (School Age)\nIdentity vs. Role Confusion (Adolescence)\nIntimacy vs. Isolation (Young Adulthood)\nGenerativity vs. Stagnation (Middle Adulthood)\nIntegrity vs. Despair (Late Adulthood).",
      "What is Kohlberg's theory of moral development?": "A theory that proposes three levels of moral reasoning:\nPreconventional level: Morality based on rewards and punishments.\nConventional level: Morality based on social norms and the approval of others.\nPostconventional level: Morality based on abstract principles and values.",
      "What is the concept of emerging adulthood?": "A period of life between adolescence and full-fledged adulthood, typically from ages 18 to 25, characterized by exploration and instability.",
      "What is the role of peers in adolescent development?": "Peers become increasingly influential in shaping identity, behavior, and social skills during adolescence.",
      "What are the main physical changes that occur during adulthood?": "Early adulthood: Peak physical performance, but with gradual declines in muscle mass and sensory abilities.\nMiddle adulthood: Noticeable physical changes such as reduced skin elasticity, greying hair, and decreased fertility.\nLate adulthood: Further declines in physical abilities, increased risk of chronic diseases, and changes in cognitive function."
    },
    "Personality": {
      "What is personality?": "A person's characteristic pattern of thinking, feeling, and behaving that is consistent over time and across situations.",
      "What is the psychodynamic theory of personality?": "A theory developed by Sigmund Freud that emphasizes unconscious motivations and conflicts, with a focus on early childhood experiences.",
      "What are the three components of Freud's structural model of personality?": "Id: The primitive, instinctual part of the mind that operates on the pleasure principle.\nEgo: The rational part of the mind that operates on the reality principle, mediating between the id and the superego.\nSuperego: The moral conscience that internalizes societal rules and ideals.",
      "What are defense mechanisms in Freud's theory?": "Unconscious strategies used by the ego to manage anxiety and conflict, such as repression, denial, projection, and displacement.",
      "What is the humanistic approach to personality?": "An approach that emphasizes personal growth, self-actualization, and the inherent goodness of people, associated with Carl Rogers and Abraham Maslow.",
      "What is self-actualization in Maslow's hierarchy of needs?": "The highest level of psychological development, where an individual realizes their full potential and becomes their best self.",
      "What is the trait theory of personality?": "A theory that focuses on identifying and measuring individual personality characteristics, or traits.",
      "What is the Five-Factor Model (Big Five) of personality?": "A widely accepted model that describes personality in terms of five broad dimensions:\nOpenness to Experience\nConscientiousness\nExtraversion\nAgreeableness\nNeuroticism.",
      "What is the social-cognitive perspective on personality?": "A theory that emphasizes the interaction between individual traits and social environments, with a focus on learning, self-efficacy, and reciprocal determinism.",
      "What is the concept of locus of control?": "A belief about the extent to which one has control over life events; an internal locus of control implies self-agency, while an external locus of control implies external influences.",
      "What is self-efficacy?": "A person's belief in their ability to succeed in specific situations or accomplish a task, as proposed by Albert Bandura.",
      "What is the difference between self-concept and self-esteem?": "Self-concept: The beliefs and knowledge one has about oneself.\nSelf-esteem: The emotional evaluation of one's self-worth.",
      "What is the role of the Rorschach inkblot test in personality assessment?": "A projective test in which individuals interpret ambiguous inkblots, revealing unconscious thoughts and feelings.",
      "What is the purpose of the Minnesota Multiphasic Personality Inventory (MMPI)?": "A widely used objective personality test designed to assess psychological disorders and personality structure."
    },
    "Psychological Disorders": {
      "What is abnormal psychology?": "The study of psychological disorders, including their symptoms, causes, and treatments.",
      "What is the DSM-5, and what is its purpose?": "The Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition, used by clinicians to diagnose and classify mental disorders.",
      "What are the criteria for diagnosing a psychological disorder?": "Patterns of behavior or mental processes that are deviant, distressing, and dysfunctional, impairing daily functioning.",
      "What is generalized anxiety disorder (GAD)?": "A disorder characterized by persistent, excessive worry about various aspects of life, often accompanied by physical symptoms like restlessness and fatigue.",
      "What is panic disorder?": "A disorder marked by recurrent, unexpected panic attacks and the fear of having more attacks.",
      "What is obsessive-compulsive disorder (OCD)?": "A disorder characterized by unwanted, repetitive thoughts (obsessions) and behaviors (compulsions) performed to reduce anxiety.",
      "What is post-traumatic stress disorder (PTSD)?": "A disorder that develops after exposure to a traumatic event, characterized by intrusive memories, flashbacks, and hyperarousal.",
      "What is major depressive disorder?": "A mood disorder characterized by persistent feelings of sadness, hopelessness, and loss of interest or pleasure in most activities.",
      "What is bipolar disorder?": "A mood disorder characterized by alternating periods of depression and mania, where mania involves elevated mood, increased activity, and impulsive behavior.",
      "What is schizophrenia?": "A severe mental disorder characterized by distorted thinking, perceptions, emotions, and behavior, including symptoms like hallucinations and delusions.",
      "What are positive and negative symptoms of schizophrenia?": "Positive symptoms: Excesses or distortions of normal functions, such as hallucinations and delusions.\nNegative symptoms: Deficits or decreases in normal functions, such as flat affect and social withdrawal.",
      "What are the symptoms of borderline personality disorder (BPD)?": "A personality disorder characterized by instability in moods, behavior, self-image, and relationships, with intense fears of abandonment and impulsive actions.",
      "What is antisocial personality disorder (ASPD)?": "A personality disorder characterized by a disregard for the rights of others, impulsivity, deceitfulness, and a lack of remorse.",
      "What is dissociative identity disorder (DID)?": "A disorder characterized by the presence of two or more distinct personality states or identities within a single individual.",
      "What is autism spectrum disorder (ASD)?": "A developmental disorder characterized by difficulties in social interaction, communication, and repetitive behaviors, with a wide range of severity.",
      "What is attention-deficit/hyperactivity disorder (ADHD)?": "A neurodevelopmental disorder characterized by inattention, hyperactivity, and impulsivity, typically diagnosed in childhood.",
      "What is the biopsychosocial model of mental illness?": "A model that explains mental disorders as the result of interactions among biological, psychological, and social factors.",
      "What are the risk factors for developing psychological disorders?": "Genetic predisposition, brain abnormalities, traumatic experiences, chronic stress, and family history."
    },
    "Treatment of Psychological Disorders": {
      "What is psychotherapy?": "A treatment method involving psychological techniques to help individuals understand and change their behavior, thoughts, and emotions.",
      "What is cognitive-behavioral therapy (CBT)?": "A type of therapy that focuses on changing negative thought patterns and behaviors to improve emotional regulation and coping strategies.",
      "What is the difference between cognitive therapy and behavioral therapy?": "Cognitive therapy: Focuses on identifying and changing distorted thinking patterns.\nBehavioral therapy: Focuses on modifying maladaptive behaviors through reinforcement, punishment, and exposure techniques.",
      "What is exposure therapy?": "A type of behavioral therapy used to treat anxiety disorders by gradually exposing individuals to feared objects or situations.",
      "What is psychodynamic therapy?": "A therapy approach based on Freud's theories, focusing on unconscious conflicts, childhood experiences, and the therapeutic relationship.",
      "What is humanistic therapy?": "A therapy approach that emphasizes personal growth, self-acceptance, and achieving one's potential, often using techniques like active listening and unconditional positive regard.",
      "What is the role of a psychiatrist in treating psychological disorders?": "A medical doctor who specializes in diagnosing and treating mental illnesses, often using medication as a primary form of treatment.",
      "What are common types of psychotropic medications?": "Antidepressants: Treat depression and anxiety disorders (e.g., SSRIs, SNRIs).\nAntipsychotics: Treat schizophrenia and other psychotic disorders.\nAnxiolytics: Treat anxiety disorders (e.g., benzodiazepines).\nMood stabilizers: Treat bipolar disorder (e.g., lithium).\nStimulants: Treat ADHD (e.g., amphetamines).",
      "What is electroconvulsive therapy (ECT)?": "A treatment for severe depression and other mental disorders that involves inducing controlled seizures through electrical stimulation of the brain.",
      "What is the purpose of group therapy?": "A form of psychotherapy in which multiple individuals with similar issues participate in therapy sessions together, providing mutual support and insight.",
      "What is family therapy?": "A type of therapy that involves treating the family as a system, focusing on improving communication, relationships, and resolving conflicts within the family unit.",
      "What is the placebo effect in the context of psychological treatment?": "The phenomenon in which individuals experience improvement in their symptoms due to their expectations of treatment, even if the treatment is inactive.",
      "What is the role of therapeutic alliance in successful treatment?": "The collaborative and trusting relationship between therapist and client, considered a key factor in the effectiveness of psychotherapy.",
      "What is the difference between efficacy and effectiveness in psychological treatments?": "Efficacy: The success of a treatment under controlled, ideal conditions (e.g., clinical trials).\nEffectiveness: The success of a treatment in real-world settings, where variables are less controlled.",
      "What are common challenges in treating psychological disorders?": "Treatment adherence, managing side effects of medication, comorbid conditions, and access to mental health care.",
      "What is resilience, and how does it relate to mental health?": "The ability to cope with stress and adversity, often associated with protective factors like strong social support, positive coping skills, and a sense of purpose."
    },
    "Social Psychology": {
      "What is social psychology?": "The study of how individuals think, feel, and behave in social contexts, including the influence of others on our behavior.",
      "What is the fundamental attribution error?": "The tendency to overestimate the influence of internal factors and underestimate the influence of external factors when explaining the behavior of others.",
      "What is cognitive dissonance?": "A psychological discomfort experienced when holding two or more conflicting cognitions (e.g., beliefs, attitudes, behaviors).",
      "What is the bystander effect?": "The phenomenon where individuals are less likely to help a victim when other people are present, due to diffusion of responsibility.",
      "What is conformity, and what factors influence it?": "Adjusting one's behavior or thinking to match that of others, influenced by group size, unanimity, and the desire to fit in.",
      "What is obedience, and what was demonstrated by Milgram's experiments?": "The act of following orders from an authority figure; Milgram's experiments demonstrated that people are likely to obey authority even when it conflicts with their personal morals.",
      "What is groupthink?": "A mode of thinking that occurs when the desire for harmony in a decision-making group overrides a realistic appraisal of alternatives, often leading to poor decisions.",
      "What is social facilitation?": "The tendency for people to perform better on simple tasks when in the presence of others, but worse on complex tasks.",
      "What is social loafing?": "The tendency for individuals to exert less effort when working in a group compared to when working alone.",
      "What is the difference between prejudice, discrimination, and stereotypes?": "Prejudice: An unjustified negative attitude toward a group and its members.\nDiscrimination: Unjustified negative behavior toward a group and its members.\nStereotypes: Overgeneralized beliefs about a group of people.",
      "What is the contact hypothesis in reducing prejudice?": "The idea that under appropriate conditions, increased contact between members of different groups can reduce prejudice.",
      "What is altruism?": "Selfless concern for the well-being of others, often leading to helping behavior without expectation of reward.",
      "What is the difference between ingroup and outgroup?": "Ingroup: A group to which an individual belongs and identifies with.\nOutgroup: A group to which an individual does not belong and may feel competition or hostility toward.",
      "What is the self-fulfilling prophecy?": "A belief or expectation that influences behavior in a way that causes the belief to come true.",
      "What is the role of social norms in behavior?": "Unwritten rules and expectations about how people should behave in social situations, guiding behavior and maintaining order.",
      "What is deindividuation, and how does it affect behavior?": "A psychological state in which individuals lose their sense of personal identity and responsibility, often leading to impulsive or deviant behavior in groups.",
      "What is the role of aggression in social behavior, and what factors contribute to it?": "Aggression is behavior intended to harm others, influenced by biological factors (e.g., hormones), environmental factors (e.g., heat, overcrowding), and social factors (e.g., frustration, modeling).",
      "What is the difference between passionate love and companionate love?": "Passionate love: Intense, physical attraction and emotional connection, often present at the beginning of a relationship.\nCompanionate love: Deep affection and commitment, often developing over time in long-term relationships.",
      "What is the social exchange theory of relationships?": "A theory that suggests relationships are maintained based on a cost-benefit analysis, where individuals seek to maximize rewards and minimize costs.",
      "What is the role of attachment styles in adult relationships?": "Patterns of attachment formed in early childhood (secure, avoidant, anxious) can influence relationship behavior and stability in adulthood.",
      "What is the role of the self-serving bias in social behavior?": "The tendency to attribute one's successes to internal factors and one's failures to external factors, protecting self-esteem.",
      "What is the mere exposure effect?": "The phenomenon that repeated exposure to a novel stimulus increases the likelihood of developing a positive attitude toward it."
    }
  }
}
